app/Http/Controllers/HomeController.php

    public function index()
    {
        $unreadNotifications = auth()->check()
            ? Message::where('receiver_id', Auth::id())->where('read_at', null)->count()
            : 0;
        $messages = auth()->check()
            ? Message::where('receiver_id', Auth::id())->get()
            : collect();
        $products = Product::inRandomOrder()->take(8)->get(); // Changed variable name to $products
        $categories = Category::all();
---
select count(*) as aggregate from "messages" where "receiver_id" = 6 and "read_at" is null
select * from "messages" where "receiver_id" = 6
select * from "products" order by RANDOM() limit 8
select * from "categories"

    public function profile()
    {
        $user = Auth::user();

        if (!$user) {
            return redirect()->route('login')->with('error', 'You must be logged in to access this page.');
        }

        $products = Product::where('user_id', $user->id)->get();
        $categories = Category::all();
---
select * from "products" where "user_id" = 6
select * from "categories"